from notat import *
if __name__ == '__main__':
    print('*Програма для ведення нотаток*')
    key_list = {
        'add': 'додати нотатку. вводить текст нотатки, який зберігається у програмі та є дійсним до її завершення.',
        'earliest': 'виводить збережені нотатки у хронологічному порядку - від найранішої до найпізнішої.',
        'latest': 'виводить збережені нотатки у хронологічному порядку - від найпізнішої до найранішої.',
        'longest': 'виводить збережені нотатки у порядку їх довжини - від найдовшої до найкоротшої.',
        'shortest': 'виводить збережені нотатки у порядку їх довжини - від найкоротшої до найдовшої.',
        'clear': 'видаляє всі нотатки',
        'exit': 'вихід з програми',
    }

    tt = menu(key_list)
    user_input_note(tt)
