'''
Програма що читає текстовий файл та, використовуючи тільки list comprehension і ніякі інше цикли, розділяє
текст на лінії (строки) методом readlines() та створює список таких строк.
'''
if __name__ == '__main__':
    with open("file.txt", "r") as file:
        lines = file.readlines()    # читає весь файл у список рядків
    tr_lines = [line.strip().lower()[line.find("a"):].capitalize() if "a" in line else "" for line in lines]
    '''
    strip() - видаляє символи нового рядка в кінці кожного рядка
    lower() - перетворює весь рядок на нижній регістр
    capitalize() - робить першу літеру рядка великою
    [line.find("a"):] - витягує підрядок від першого входження "a" до кінця рядка
    if "a" in line - Умова гарантує, що рядок трансформується лише в тому випадку, якщо він містить букву "а" . 
    Якщо буква не знайдена, весь рядок видаляється.
    '''
    print(f'Вихідний список: {tr_lines}')