# програма, що зчитує числа від користувача поки не буде введено ключове слово sum.
# вводимо число
number = input('Ведіть будь-яке число чи sum:')
# задаємо початкове значення для сумування
number_sum = 0
# запускаємо цикл в якому умова, якщо те що ми ввели не дорівнює sum тоді виконуємо наступне
while number != 'sum':
    # намагаэмося виконати, початкове значення додаємо до введеного
    try:
        number_sum += float(number)
    # якщо при вводі у нас буде не число тоді виконається ця умова
    except ValueError:
        print('Введіть число або sum, будь-ласка!')
    # ввід даних всередині циклу
    number = input('Ведіть будь-яке число чи sum::')
# якщо введене буде дорівнювати sum, тоді виводиться результат суми
else:
    print(f'В сумі чисел отримаємо таке знвчення: {number_sum}')
