# Програма, яка симулює примітивне бото-спілкування.
# while - цикл, для того щоб программа постійно працювала
while True:
    # задаємо списки зверненнь користувача
    hi1 = 'Привіт / Хай / Доброго дня'
    hi2 = 'Як справи? / Що робиш? / Чим займаєшся?'
    hi3 = 'Фільм / Кінотеатр / Серіал'
    hi4 = 'Бувай / Надобраніч / Гудбай / До зустрічі'
    # вводимо одне з слів із списків
    info1 = str(input('Давай поспілкуємося: '))
    # виконується порівняння введеного слова зі нашими списками та виводится результат
    if info1 in hi1:
        print('Доброго вечора, я бот з України!')
    elif info1 in hi2:
        print('Вчусь програмувати на Python!')
    elif info1 in hi3:
        print('Соррі що втручуюсь, не знаю про що йдеться мова, '
              'але подивіться серіал "Wednesday", він просто бомба!')
    # виводится результат і завершується розмова
    elif info1 in hi4:
        print("Побачимось у мережі, I'll be back.")
        exit(0)
    # якщо введено слово немає в нашому списку, то виводится такий результат
    else:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')
