# Програма, яка симулює примітивне бото-спілкування.
while
# Привіт / Хай / Доброго дня => Доброго вечора, я бот з України!
user = str(input('Вітання: '))
print(f'{user}, я бот з України!')
# Як справи? / Що робиш? / Чим займаєшся? => Вчусь програмувати на Python!
user = str(input('Вітання: '))
print(f'{user}, я бот з України!')
# Фільм / Кінотеатр / Серіал => Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм *ваша відповідь*, він просто бомба!

# Бувай / Надобраніч / Гудбай / До зустрічі => Побачимось у мережі, I'll be back.

# Завершити виконання програми

# Ключових слів не знайдено* => Дуже цікаво, але, нажаль, нічого не зрозуміло

# Якщо хочете, можете додати свої пари теж, або замінити існуючі, але має бути не менше 3 пар та одна з них - вихід з діалогу. Рекомендую поки не занурюватись занадто глибоко - через декілька занять ми зможемо зробити цього бота на більш цікавому рівні, тому не марнуйте час зараз.

