# Програма, яка симулює примітивне бото-спілкування.
# while - цикл, для того щоб программа постійно працювала
while True:
    # вводимо одне з слів із списків
    info1 = str(input('''Привіт! Давай поспілкуємося
Або для завершення розмови напишить одне з слів - Бувай / Надобраніч / Гудбай / До зустрічі
>''').lower())
    # виконується порівняння введеного слова зі нашими списками та виводится результат
    if 'привіт' in info1 or 'хай' in info1 or 'доброго дня' in info1:
        print('>>>Доброго вечора, я бот з України!')

    elif 'справи' in info1 or 'робиш' in info1 or 'займаєшся' in info1:
        print('>>>Вчусь програмувати на Python!')

    elif 'фільм' in info1 or 'кінотеатр' in info1 or 'серіал' in info1:
        print('>>>Соррі що втручуюсь, не знаю про що йдеться мова, '
              'але подивіться серіал "Wednesday", він просто бомба!')

    # виводится результат і завершується розмова
    elif 'бувай' in info1 or 'надобраніч' in info1 or 'гудбай' in info1 or 'до зустрічі' in info1:
        print(">>>Побачимось у мережі, I'll be back.")
        exit(0)
    # якщо введено слово немає в нашому списку, то виводится такий результат
    else:
        print('''>>>>Дуже цікаво, але, нажаль, нічого не зрозуміло :(
СПРОБУЙ ЩЕ РАЗ''')
