from trik1 import *

if __name__ == '__main__':
    print('Перевіра чи існує трикутник та його периметр і площа')
    while True:
        try:
            # вхідні дані:
            a, b, c = int(input('Сторона а: ')), int(input('Сторона b: ')), int(
                input('Сторона c: '))
            # перевірка чи трикутник більше 0 через функцію cile
            abc = cile(a, b, c)
            # якщо сторони більше 0 тоді перевірка чи існує такий трикутник,
            # якщо існую то вираховує периметр і площу через функції perimt і plosh
            if trik(a, b, c):
                p = perimt(a, b, c)
                s = plosh(p, a, b, c)
                print(f"Периметр трикутника зі сторонами {a}, {b}, {c} складає: {p}")
                print(f"Площа трикутника зі сторонами {a}, {b}, {c} складає: {s}")
            else:
                print(f'Трикутник зі сторонами {a}, {b}, {c} існувати не може та периметра і площі не має.)')
        except ValueError:
            print('Значення повинні бути цілі')
