# Програма, що рахує абонплату за комунальним лічильника
abonent = input("""Выберите одно:
1. Оплата абонплати за електроенергю 
2. Оплата абонплати за газ
>>""")

if abonent == '1':
    x = input("""Введіть попередні значення лічильника:
>>""")
    x = float(x)
    y = input("""Введіть поточні значення лічильника:
>>""")
    y = float(y)
    z = input("""Скільки коштує 1 кВт електроенергії:
>>""")
    z = float(z)

# вирахувати різницю між данними
    summ = y - x
# отримати скільки буде коштувати дана різниця
    buy = abs(round(summ * z, 2))
    print(f'Треба сплатити: {buy} UAH')

if abonent == '2':
    x = input("""Введіть попередні значення лічильника:
>>""")
    x = float(x)
    y = input("""Введіть поточні значення лічильника:
>>""")
    y = float(y)
    z = input("""Скільки коштує 1 куб газу:
>>""")
    z = float(z)

# вирахувати різницю між данними
    summ = y - x
# отримати скільки буде коштувати дана різниця
    buy = abs(round(summ * z, 2))
    print(f'Треба сплатити: {buy} UAH')
